# Pandas Joins

In [2]:
# Standard Python line to import pandas library
# It's imported as 'pd' for less typing later!

# Matplotlib is the plotting library that pandas uses
# It is imported as 'plt' for less typing also :)

import pandas as pd
import matplotlib.pyplot as plt

# Setting the options to view charts in the notebook
%matplotlib inline

# setting the options to display the whole dataframe
pd.set_option('display.max_rows', 500)
pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1000)

In [3]:
# The below cell just writes a simple datafile so we can show the groupby
# The %%writefile is a magic command for jupyter notebooks - to write that cell to the filename

In [4]:
%%writefile group.csv
Index,State,Amount
0,CA,100
1,CA,205
2,CO,367
3,NY,365
4,GA,525
5,CA,150
6,CO,342

Writing group.csv

In [10]:
# The below cells just make new data files to show the different dataframe joins

In [15]:
%%writefile file1.txt

ID, Amount
1,100
2,300
3,150
4,200
5,500
6,1000

Writing file1.txt

In [16]:
%%writefile file2.txt

ID, State
1, ""
2,"NY"
3,"CA"
4, ""
5, ""
6,"CO"

Writing file2.txt

In [17]:
%%writefile file1_1.txt
ID, Amount
7, 400
8, 123

Writing file1_1.txt

In [18]:
%%writefile file2_2.txt

ID, State
2,"NY"
3,"CA"
6,"CO"
7,"OR"

Writing file2_2.txt

In [4]:
df1 = pd.read_csv("file1.txt")
df1_1 = pd.read_csv("file1_1.txt")
df2 = pd.read_csv("file2.txt")
df2_2 = pd.read_csv("file2_2.txt")

## Dataframe joins

- pd.merge() : Takes two dataframes and joins them on a key that is the same for each dataframe.  The column containing the ID has to have the same column name.
- merge/joins are useful when you have two dataframes that do not have the same number of rows.  For example, customer information in one dataframe and if a customer is signed up for a certain program in another dataframe.  Not all customers might be signed up for the program so their IDs might not be in the second dataframe.
- DataFrame.join(): works the same as pd.merge(). In fact, pd.merge uses the dataframe.join() method.
- Pandas has 4 types of merge/joins:  inner, outer, left and right.  



The syntax of each is demonstrated below:

## Inner and Outer Joins

In [18]:
pd.merge(df1, df2_2, on='ID', how = 'outer')

   ID   Amount  State
0   1    100.0    NaN
1   2    300.0     NY
2   3    150.0     CA
3   4    200.0    NaN
4   5    500.0    NaN
5   6   1000.0     CO
6   7      NaN     OR

In [18]:
df1.join(df2_2,on='ID',how='outer', lsuffix='_l', rsuffix='_r')

   ID  ID_l   Amount  ID_r  State
0   1   1.0    100.0   3.0     CA
1   2   2.0    300.0   6.0     CO
2   3   3.0    150.0   7.0     OR
3   4   4.0    200.0   NaN    NaN
4   5   5.0    500.0   NaN    NaN
5   6   6.0   1000.0   NaN    NaN
5   0   NaN      NaN   2.0     NY

In [19]:
pd.merge(df1, df2_2, on='ID', how = 'inner')

   ID   Amount  State
0   2      300     NY
1   3      150     CA
2   6     1000     CO

In [17]:
df1.join(df2_2,on='ID',how='inner', lsuffix='_l', rsuffix='_r')

   ID  ID_l   Amount  ID_r  State
0   1     1      100     3     CA
1   2     2      300     6     CO
2   3     3      150     7     OR

## Left Join

In [9]:
# same as:
# pd.merge(df1, df2_2, on='ID', how = 'left')
df1.join(df2_2,on='ID',how='left', lsuffix='_l', rsuffix='_r')

   ID   Amount  State
0   1      100    NaN
1   2      300     NY
2   3      150     CA
3   4      200    NaN
4   5      500    NaN
5   6     1000     CO

In [14]:
# same as:
# df1.join(df2_2,on='ID',how='left', lsuffix='_l', rsuffix='_r')
pd.merge(df1, df2_2, on='ID', how = 'left')

   ID   Amount  State
0   1      100    NaN
1   2      300     NY
2   3      150     CA
3   4      200    NaN
4   5      500    NaN
5   6     1000     CO

## Right Join

In [15]:
# same as
# df1.join(df2_2,on='ID',how='right', lsuffix='_l', rsuffix='_r')
pd.merge(df1, df2_2, on='ID', how = 'right')

   ID   Amount  State
0   2    300.0     NY
1   3    150.0     CA
2   6   1000.0     CO
3   7      NaN     OR

In [11]:
# same as:
# pd.merge(df1, df2_2, on='ID', how = 'right')

df1.join(df2_2,on='ID',how='right', lsuffix='_l', rsuffix='_r')

   ID  ID_l   Amount  ID_r  State
0   1   1.0    100.0     3     CA
1   2   2.0    300.0     6     CO
2   3   3.0    150.0     7     OR
5   0   NaN      NaN     2     NY